const hoh_roles = [
  { name: "बाबु", id: "father" },
  { name: "आमा", id: "mother" },
  { name: "जेठो दाई", id: "eldest_son" },
];
const gender_choice = [
  { name: "पुरूष", id: "1" },
  { name: "महिला", id: "2" },
  { name: "अन्य", id: "3" },
];

const static_relations = [
  { id: "1", name: "आफै" },
  { id: "2", name: "श्रीमान्‌" },
  { id: "3", name: "श्रीमती" },
  { id: "4", name: "छोरा" },
  { id: "5", name: "बुहारी" },
  { id: "6", name: "छोरी" },
  { id: "7", name: "ज्वाइँ" },
  { id: "8", name: "बुवा" },
  { id: "9", name: "आमा" },
  { id: "10", name: "दाजु" },
  { id: "11", name: "भाई" },
  { id: "12", name: "दिदी" },
  { id: "13", name: "बहिनी" },
  { id: "14", name: "हजुरबा" },
  { id: "15", name: "हजुरआमा" },
  { id: "16", name: "नाति" },
  { id: "17", name: "नातिनी" },
  { id: "18", name: "काका" },
  { id: "19", name: "काकी" },
  { id: "20", name: "भाउजु" },
  { id: "21", name: "नन्द" },
  { id: "22", name: "फुफु" },
  { id: "23", name: "भान्जा" },
  { id: "24", name: "पनाति/पनातिनी" },
  { id: "25", name: "घरेलु कामदार" },
  { id: "27", name: "सासु" },
  { id: "28", name: "ससुरा" },
  { id: "29", name: "नातिनी बुहारी" },
  { id: "30", name: "पनातिनि बुहारी" },
  { id: "26", name: "अन्य" },
];

const relations = static_relations;

const mother_tongues = [
  // { id: "1", name: "नेपाली" },
  // {
  //   id: "2",
  //   name: "मैथिली",
  // },
  // {
  //   id: "3",
  //   name: "थारु",
  // },
  {
    id: "3",
    name: "नेपाली",
  },
  { id: "4", name: "तामाङ" },
  { id: "22", name: "नेवारी" },

  // {
  //   id: "5",
  //   name: "नेपालभाषा",
  // },
  // {
  //   id: "6",
  //   name: "बज्जीका",
  // },
  { id: "7", name: "मगर" },
  // {
  //   id: "8",
  //   name: "डोटली",
  // },
  // {
  //   id: "9",
  //   name: "उर्दु",
  // },
  // {
  //   id: "10",
  //   name: "अवधी",
  // },
  { id: "21", name: "माझी" },
  { id: "20", name: "थामी" },

  { id: "11", name: "लिम्बु" },
  { id: "12", name: "गुरुङ" },
  // {
  //   id: "13",
  //   name: "बैतडेली",
  // },
  { id: "14", name: "राई" },
  // {
  //   id: "15",
  //   name: "अछामी",
  // },
  // {
  //   id: "16",
  //   name: "बान्तवा",
  // },
  // {
  //   id: "17",
  //   name: "राजबंशी",
  // },
  // {
  //   id: "18",
  //   name: "शेर्पा",
  // },
  // {
  //   id: "19",
  //   name: "भोजपुरी",
  // },
  { id: "23", name: "अन्य" },
];

const education_levels = [
  { id: "1", name: "निरक्षर" },
  { id: "2", name: "साक्षर(५ कक्षा वा तल्लो योग्यता)" },
  { id: "3", name: "८ कक्षा वा तल्लो योग्यता" },
  { id: "4", name: "८ कक्षा उतिर्ण" },
  { id: "5", name: "10 कक्षा उतिर्ण (टेस्ट)" },
  { id: "6", name: "एस .एल .सी / एसईई" },
  { id: "7", name: "१२ कक्षा उतिर्ण" },
  { id: "8", name: "स्नातक (ब्याचेलर)" },
  { id: "9", name: "स्तातकोतर (मास्टर्स)" },
  { id: "10", name: "विद्यावारिधी(पि.एच.डी) " },
  { id: "11", name: "अन्य" },
];

const education_faculties = [
  { id: "मानविकी तथा सामाजिक शास्त्र", name: "मानविकी तथा सामाजिक शास्त्र" },
  { id: "शिक्षा", name: "शिक्षा" },
  { id: "व्यवस्थापन", name: "व्यवस्थापन" },
  { id: "कानुन", name: "कानुन" },
  { id: "विज्ञान तथा प्रविधि", name: "विज्ञान तथा प्रविधि" },
  { id: "स्वास्थ /चिकित्साशास्त्र", name: "स्वास्थ /चिकित्साशास्त्र" },
  { id: "इन्जिनियरिङ", name: "इन्जिनियरिङ" },
  { id: "वन", name: "वन" },
  { id: "कम्प्युटर/सुचना प्रविधि", name: "कम्प्युटर/सुचना प्रविधि" },
  {
    id: "पशु विज्ञान/पशुचिकित्सा/मत्स्यपालन",
    name: "पशु विज्ञान/पशुचिकित्सा/मत्स्यपालन",
  },
  { id: "वातावरण", name: "वातावरण" },
];

const education_leave_reasons = [
  { id: "पढने खर्च नभएर", name: "पढने खर्च नभएर" },
  { id: "पढने इच्छा नभएर", name: "पढने इच्छा नभएर" },
  { id: "शैक्षिक संस्था टाढा भएर", name: "शैक्षिक संस्था टाढा भएर" },
  { id: "बिवाह भएर", name: "बिवाह भएर" },
  { id: "बा-आमाले पढ्न नदिएर", name: "बा-आमाले पढ्न नदिएर" },
  { id: "बसाई सरेकोले", name: "बसाई सरेकोले" },
  { id: "बच्चै भएकाले", name: "बच्चै भएकाले" },
  { id: "अन्य", name: "अन्य" },
];

const education_statuses = [
  { id: "1", name: " विद्यालयनै नगएको" },
  { id: "2", name: "पढाइ छाडेको" },
  { id: "3", name: "अध्ययनरत" },
  { id: "4", name: "स्नातक (ब्याचेलर) पास भई छाडेको" },
];

const marital_statuses = [
  { id: "1", name: " सामान्य विवाहित" },
  { id: "2", name: "बहु बिबाह" },
  { id: "3", name: "पारपाचुके/सम्बन्ध विच्छेद" },
  { id: "4", name: " पुन विवाह" },
  { id: "5", name: "एकल महिला/ पुरूष" },
  { id: "6", name: "छुट्टिएको" },
  { id: "7", name: "अन्य" },
];

const vehicle_types = [
  { id: "1", name: "अटो रिक्सा" },
  { id: "2", name: "मोटरसाइकल/स्कुटर" },
  { id: "3", name: "कार" },
  { id: "4", name: "जिप/भ्यान" },
  { id: "5", name: "बस" },
  { id: "6", name: "ट्रक/ टिपर" },
  { id: "7", name: "डोजर लोडर हेभी उपकरण" },
  { id: "8", name: "अन्य" },
];

const disability_types = [
  { id: "शारिरिक अपाङ्गता", name: "शारिरिक अपाङ्गता" },
  { id: "न्यून दृष्टियुक्त", name: "न्यून दृष्टियुक्त" },
  { id: "पूर्ण दृष्टिविहिन", name: "पूर्ण दृष्टिविहिन" },
  { id: "बहिरापन", name: "बहिरापन" },
  { id: "सुस्तश्रवण", name: "सुस्तश्रवण" },
  { id: "श्रवन दृष्ट्रिविहिन", name: "श्रवन दृष्ट्रिविहिन" },
  { id: "स्वर र बोलाई", name: "स्वर र बोलाई" },
  { id: "मानसिक वा मनोसामाजिक", name: "मानसिक वा मनोसामाजिक" },
  { id: "बौद्धिक अपाङ्गता", name: "बौद्धिक अपाङ्गता" },
  { id: "अनुवंशीय अपाङ्गता", name: "अनुवंशीय अपाङ्गता" },
  { id: "अटिजम्", name: "अटिजम्" },
  { id: "बहुअपाङ्गता", name: "बहुअपाङ्गता" },
  { id: "अन्य", name: "अन्य" },
];

const disability_card_types = [
  { id: "1", name: "रातो" },
  { id: "2", name: "निलो" },
  { id: "3", name: "सेतो" },
  { id: "4", name: "पाएको छैन" },
];

const disease_names = [
  { id: "मुटु रोग", name: "मुटु रोग" },
  { id: "दम/श्वासप्रश्वास सम्बन्धी", name: "दम/श्वासप्रश्वास सम्बन्धी" },
  { id: "अर्बुद (क्यानसर)", name: "अर्बुद (क्यानसर)" },
  { id: "मधुमेह ( डायबिटिज)", name: "मधुमेह ( डायबिटिज)" },
  { id: "मृगौला / कलेजोको रोग", name: "मृगौला / कलेजोको रोग" },
  { id: "स्त्रीरोग", name: "स्त्रीरोग" },
  { id: "अल्सर/ आन्द्राको रोग", name: "अल्सर/ आन्द्राको रोग" },
  { id: "उच्च रक्तचाप", name: "उच्च रक्तचाप" },
  { id: "निम्न रक्तचाप", name: "निम्न रक्तचाप" },
  { id: "बाथ", name: "बाथ" },
  { id: "इपिलेप्सी", name: "इपिलेप्सी" },
  { id: "पार्किन्सन्स्‌", name: "पार्किन्सन्स्‌" },
  { id: "अल्जाईमर्स", name: "अल्जाईमर्स" },
  { id: "अन्य", name: "अन्य" },
];

const technical_skills = [
  { id: "1", name: "इलेक्ट्रीसियन" },
  { id: "2", name: "डकर्मी" },
  { id: "3", name: "पेन्टर" },
  { id: "4", name: "प्लम्बर" },
  { id: "5", name: "सिकर्मी" },
  { id: "6", name: "सुचना प्रविधि" },
  { id: "7", name: "सिलाई बुनाई" },
  { id: "8", name: "ब्युटी पार्लर" },
  { id: "9", name: "अन्य" },
];

const death_reasons = [
  { id: "1", name: "दुर्घटना" },
  { id: "2", name: "आत्महत्या" },
  { id: "3", name: "दिर्घरोगी वा अन्य रोग" },
  { id: "4", name: "हत्या" },
  { id: "5", name: "हराएको" },
  { id: "6", name: "बेपत्ता पारिएको" },
  { id: "7", name: "थाहा नभएको" },
];

const foreign_reasons = [
  // { id: "1", name: "रोजगारी" },
  // { id: "2", name: "ब्यापार" },
  // { id: "3", name: "अध्ययन" },
  // { id: "4", name: "आप्रबास" },
  { id: "1", name: "तलब/ज्याला/नोकरी" },
  { id: "2", name: "व्यापार/व्यवसाय" },
  { id: "3", name: "अध्ययन/तालिम" },
  { id: "4", name: "कामको खोजी" },
  { id: "4", name: "आश्रित" },
  { id: "5", name: "अन्य" },
];

const festivals = [
  { id: "1", name: "एकादशी ब्रत" },
  { id: "2", name: "ल्होसार" },
  { id: "3", name: "तिहार" },
  { id: "4", name: "इद" },
  { id: "5", name: "क्रिसमस" },
  { id: "6", name: "रमजान" },
  { id: "7", name: "दशैँ" },
  { id: "8", name: "चैते दशैँ" },
  { id: "9", name: "राम नवमी" },
  { id: "10", name: "कृष्ण जन्माष्टमी" },
  { id: "11", name: "जनै पुर्णिमा" },
  { id: "12", name: "पाहांचर्हे" },
  { id: "13", name: "सिथिनख:" },
  { id: "14", name: "गाइजात्रा" },
  { id: "15", name: "गुरु पुर्णिमा" },
  { id: "16", name: "नयाँ वर्ष" },
  { id: "17", name: "न्हुँ दं नेपाल सम्बत" },
  { id: "18", name: "इन्द्रजात्रा" },
  { id: "19", name: "माघे संक्रान्ती" },
  { id: "20", name: "छठ" },
];

const water_sources = [
  { id: "1", name: "मुलको धारा" },
  { id: "2", name: "लिफ्टको धारा" },
  { id: "3", name: "कुवा/पधेरा" },
  { id: "4", name: "मूल" },
  { id: "5", name: "खोला" },
  { id: "6", name: "अन्य" },
];

const cooking_fuels = [
  { id: "1", name: "दाउरा" },
  { id: "2", name: "एलपी ग्याँस" },
  { id: "3", name: "विद्युत" },
  { id: "4", name: "गोबर ग्याँस" },
  { id: "5", name: "अन्य" },
];

const light_fuels = [
  { id: "1", name: "रास्टिय विद्युत" },
  { id: "2", name: "स्थानीय विद्युत" },
  { id: "3", name: "सोलार" },
  { id: "4", name: "मट्टितेल" },
  { id: "5", name: "दाउरा" },
  { id: "6", name: "अन्य" },
];

const toilet_types = [
  { id: "1", name: "पक्की" },
  { id: "2", name: "कच्ची" },
  { id: "3", name: "नभएको" },
];

const animal_types = [
  { id: "1", name: "गाइ/गोरु, बाच्छा/बाच्छी" },
  { id: "2", name: "राँगा/भैंसी, पाडा/पाडी" },
  { id: "3", name: "याक / चौरी" },
  { id: "4", name: "बाख्रा/भेंडा, खसी/बोका" },
  { id: "5", name: "सुँगुर / बंगुर" },
  { id: "6", name: "कुखुरा / हाँस / परेवा" },
  { id: "7", name: "अष्ट्रीच" },
  { id: "8", name: "कुकुर/ बिरालो /खरायो" },
];

const house_types = [
  { id: "1", name: "भुकम्प कच्ची" },
  { id: "2", name: "कच्ची" },
  { id: "3", name: "कच्ची नभत्काएको" },
  { id: "4", name: "पक्की" },
  { id: "5", name: "भुकम्प पक्की" },
  { id: "6", name: "कच्ची (खरको)" },
  { id: "7", name: "टहरा" },
  { id: "8", name: "अन्य" },
];

const disaster_types = [
  { id: "1", name: "बाढी" },
  { id: "2", name: "पहिरो" },
  { id: "3", name: "भूक्षय" },
  { id: "4", name: "आँधी÷हुरीबतास " },
  { id: "5", name: "चट्याङ्ग" },
  { id: "6", name: "असिना" },
  { id: "7", name: "अतिवृष्टि" },
  { id: "8", name: "खण्डवृष्टि" },
  { id: "9", name: "लू" },
  { id: "10", name: "शितलहर" },
  { id: "11", name: "सुख्खा वा खडेरी" },
  { id: "12", name: "आगलागी (बस्तीमा)" },
  { id: "13", name: "वन डडेलो" },
  { id: "14", name: "हिमताल विस्फोटन" },
  { id: "15", name: "हिमपहिरो" },
];

const disaster_location = [
  { id: "1", name: "घर" },
  { id: "2", name: "खेत" },
  { id: "3", name: "बारी" },
  { id: "4", name: "घर/खेत" },
  { id: "5", name: "घर/बारी" },
  { id: "6", name: "खेत/बारी" },
];
const land_types = [
  { id: "1", name: "खेत-अब्बल (धेरै फल्ने)" },
  { id: "2", name: "खेत-दोयम" },
  { id: "3", name: "खेत-सीम" },
  { id: "4", name: "खेत-चाहार (साह्रै कम फल्ने)" },
  { id: "5", name: "पाखा/बारी-अब्बल (धेरै फल्ने)" },
  { id: "6", name: "पाखा/बारी-दोयम" },
  { id: "7", name: "पाखा/बारी-सीम" },
  { id: "8", name: "पाखा/बारी-चाहार (साह्रै कम फल्ने)"},
  { id: "9", name: "घडेरी" },
   ];

const socialNetworks = [
  { name: "फेसबुक", id: "facebook" },
  { name: "युट्युव", id: "youtube" },
  { name: "टिकटक", id: "ticktock" },
  { name: "भाईबर", id: "viber" },
  { name: "ट्विटर", id: "twitter" },
  { name: "ह्वाट्स एप", id: "whatsapp" },
  { name: "ईमो", id: "emo" },
  { name: "गुगल", id: "emo" },
];

const developmentOption = [
  { name: "सडक", id: "सडक" },
  { name: "कृषि/पशुपन्छी", id: "कृषि/पशुपन्छी" },
  { name: "शिक्षा", id: "शिक्षा" },
  { name: "स्वाथ्य", id: "स्वाथ्य" },
  { name: "पर्यटन", id: "पर्यटन" },
  { name: "खानेपानी", id: "खानेपानी" },
  { name: "सिंचाई", id: "सिंचाई" },
];
const residence_types = [
  { name: "जन्मसिद्ध", id: "1" },
  { name: "बसाईसराई", id: "2" },
  { name: "अस्थायी", id: "3" },
];

const residence_district = [
  { name: "रामेछाप अन्य पालिका", id: "रामेछाप अन्य पालिका" },
  { name: "सिन्धुली", id: "सिन्धुली" },
  { name: "दोलखा", id: "दोलखा" },
  { name: "काभ्रेपलान्चोक", id: "काभ्रेपलान्चोक" },
  { name: "सिन्धुपाल्चोक", id: "सिन्धुपाल्चोक" },
  { name: "काठमाडौँ", id: "काठमाडौँ" },
  { name: "भक्तपुर", id: "भक्तपुर" },
  { name: "ललितपुर", id: "ललितपुर" },
  { name: "धादिङ", id: "धादिङ" },
  { name: "नुवाकोट", id: "नुवाकोट" },
  { name: "रसुवा", id: "रसुवा" },
  { name: "चितवन", id: "चितवन" },
  { name: "मकवानपुर", id: "मकवानपुर" },
  { name: "भोजपुर", id: "भोजपुर" },
  { name: "धनकुटा", id: "धनकुटा" },
  { name: "इलाम", id: "इलाम" },
  { name: "झापा", id: "झापा" },
  { name: "खोटाँग", id: "खोटाँग" },
  { name: "मोरंग", id: "मोरंग" },
  { name: "ओखलढुंगा", id: "ओखलढुंगा" },
  { name: "पांचथर", id: "पांचथर" },
  { name: "संखुवासभा", id: "संखुवासभा" },
  { name: "सोलुखुम्बू", id: "सोलुखुम्बू" },
  { name: "सुनसरी", id: "सुनसरी" },
  { name: "ताप्लेजुंग", id: "ताप्लेजुंग" },
  { name: "तेह्रथुम", id: "तेह्रथुम" },
  { name: "उदयपुर", id: "उदयपुर" },
  { name: "सप्तरी", id: "सप्तरी" },
  { name: "सिराहा", id: "सिराहा" },
  { name: "धनुषा", id: "धनुषा" },
  { name: "महोत्तरी", id: "महोत्तरी" },
  { name: "सर्लाही", id: "सर्लाही" },
  { name: "बारा", id: "बारा" },
  { name: "पर्सा", id: "पर्सा" },
  { name: "रौतहट", id: "रौतहट" },
  { name: "बागलुङ", id: "बागलुङ" },
  { name: "गोरखा", id: "गोरखा" },
  { name: "कास्की", id: "कास्की" },
  { name: "लमजुङ", id: "लमजुङ" },
  { name: "मनाङ", id: "मनाङ" },
  { name: "मुस्ताङ", id: "मुस्ताङ" },
  { name: "म्याग्दी", id: "म्याग्दी" },
  { name: "नवलपुर", id: "नवलपुर" },
  { name: "पर्वत", id: "पर्वत" },
  { name: "स्याङग्जा", id: "स्याङग्जा" },
  { name: "तनहुँ", id: "तनहुँ" },
  { name: "कपिलवस्तु", id: "कपिलवस्तु" },
  { name: "परासी", id: "परासी" },
  { name: "रुपन्देही", id: "रुपन्देही" },
  { name: "अर्घाखाँची", id: "अर्घाखाँची" },
  { name: "गुल्मी", id: "गुल्मी" },
  { name: "पाल्पा", id: "पाल्पा" },
  { name: "दाङ", id: "दाङ" },
  { name: "प्युठान", id: "प्युठान" },
  { name: "रोल्पा", id: "रोल्पा" },
  { name: "पूर्वी रूकुम", id: "पूर्वी रूकुम" },
  { name: "बाँके", id: "बाँके" },
  { name: "बर्दिया", id: "बर्दिया" },
  { name: "पश्चिमी रूकुम", id: "पश्चिमी रूकुम" },
  { name: "सल्यान", id: "सल्यान" },
  { name: "डोल्पा", id: "डोल्पा" },
  { name: "हुम्ला", id: "हुम्ला" },
  { name: "जुम्ला", id: "जुम्ला" },
  { name: "कालिकोट", id: "कालिकोट" },
  { name: "मुगु", id: "मुगु" },
  { name: "सुर्खेत", id: "सुर्खेत" },
  { name: "दैलेख", id: "दैलेख" },
  { name: "जाजरकोट", id: "जाजरकोट" },
  { name: "कैलाली", id: "कैलाली" },
  { name: "अछाम", id: "अछाम" },
  { name: "डोटी", id: "डोटी" },
  { name: "बझाङ", id: "बझाङ" },
  { name: "बाजुरा", id: "बाजुरा" },
  { name: "कंचनपुर", id: "कंचनपुर" },
  { name: "डडेलधुरा", id: "डडेलधुरा" },
  { name: "बैतडी", id: "बैतडी" },
  { name: "दार्चुला", id: "दार्चुला" },
];

const income_sources = [
  { id: "1", name: "कृषि" },
  { id: "2", name: "व्यापार" },
  { id: "3", name: "उद्योग" },
  { id: "4", name: "जागीर" },
  { id: "5", name: "बैदेशिक रोजगार(विप्रेषण)" },
  { id: "6", name: "भाडा (बहाल)" },
  { id: "7", name: "उद्यम" },
  { id: "8", name: "अन्य" },
];

const expense_sources = [
  { id: "1", name: "खाना/लाउन" },
  { id: "2", name: "शिक्षा " },
  { id: "3", name: "स्वास्थ्य" },
  { id: "4", name: "कर तथा सेवा शुल्क  भुक्तानी " },
  { id: "5", name: "मनोरञ्जन कार्य" },
  { id: "6", name: "सामाजिक कार्य" },
  { id: "7", name: "ऋण भुक्तानी " },
  { id: "8", name: "दान" },
  { id: "9", name: "अन्य" },
];

const facilities = [
  { id: "1", name: "रेडियो" },
  { id: "2", name: "टेलिभिजन" },
  { id: "3", name: "साधारण मोबाईल फोन" },
  { id: "4", name: "स्मार्ट फोन" },
  { id: "5", name: "ट्याबलेट" },
  { id: "6", name: "कम्प्युटर" },
  { id: "7", name: "ल्यापटप" },
  { id: "8", name: "इन्टरनेट" },
  { id: "9", name: "मोटरसाइकल / स्कुटर" },
  { id: "10", name: "मोटर कार" },
  { id: "11", name: "रेफ्रिजरेटरर" },
  { id: "12", name: "बासिङ मेसिन" },
  { id: "13", name: "एयर कण्डिसनर" },
  { id: "14", name: "अन्य सवारी/ढुवानीको साधन(ट्रक,बस,मनीबस आदि)" },
  { id: "15", name: "ट्याक्टर" },
  { id: "16", name: "वाटर फिल्टर" },
  { id: "17", name: "बिद्युतीय पंखा" },
];

const yes_nos = [
  { name: "छ", id: "1" },
  { name: "छैन", id: "0" },
];

export {
  education_leave_reasons,
  facilities,
  income_sources,
  expense_sources,
  hoh_roles,
  gender_choice,
  relations,
  mother_tongues,
  education_levels,
  education_faculties,
  education_statuses,
  marital_statuses,
  vehicle_types,
  disability_types,
  disability_card_types,
  disease_names,
  death_reasons,
  foreign_reasons,
  festivals,
  water_sources,
  cooking_fuels,
  light_fuels,
  toilet_types,
  animal_types,
  house_types,
  disaster_types,
  land_types,
  socialNetworks,
  developmentOption,
  residence_types,
  residence_district,
  disaster_location,
  yes_nos,
  technical_skills,
};
